IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_csfr_regs.xml
<module id="CSFR" HW_revision="" description="CSFR Registers">
	<register id="MMSR" width="8" page="1" offset="0xd28" internal="0" description="MemManage Fault Status Register">
		<bitfield id="IACCVIOL" description="Instruction access violation flag" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DACCVIOL" description="Data access violation flag" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MUNSTKERR" description="MemManage fault on unstacking for a return from exception" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MSTKERR" description="MemManage fault on stacking for exception entry" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MMARVALID" description="MemManage Fault Address Register (MMFAR) valid flag" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="BFSR" width="8" page="1" offset="0xd29" internal="0" description="BusFault Status Register">
		<bitfield id="IBUSERR" description="Instruction bus error" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PRECISERR" description="Precise data bus error" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="IMPRECISERR" description="Imprecise data bus error" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="UNSTKERR" description="BusFault on unstacking for a return from exception" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="STKERR" description="BusFault on stacking for exception entry" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="BFARVALID" description="BusFault Address Register (BFAR) valid flag" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="UFSR" width="16" page="1" offset="0xd2a" internal="0" description="UsageFault Status Register">
		<bitfield id="UNDEFINSTR" description="Undefined instruction UsageFault" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INVSTATE" description="Invalid state UsageFault" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INVPC" description="Invalid PC load UsageFault" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="NOCP" description="No coprocessor UsageFault" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="UNALIGNED" description="Unaligned access UsageFault" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="DIVBYZERO" description="Divide by zero UsageFault" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
</module>
